Repository: gentpan/CLIState
Catalog: App/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: No services detected.
zh_hans: 未检测到服务。

source: No supported uninstall action
zh_hans: 暂不支持卸载

source: No supported update action
zh_hans: 暂不支持更新

source: No tools
zh_hans: 没有工具

source: No tools in this group.
zh_hans: 该组暂无工具。

source: No tools match the selected filters.
zh_hans: 没有工具符合当前的筛选条件。

source: No use recorded yet. CLI State reads when each command last ran; commands built into macOS don't record it.
zh_hans: 还没有使用记录。CLI State 通过命令最后一次运行的时间来统计，macOS 自带的命令不会记录这个时间。

source: Not Linked
zh_hans: 未链接

source: Not Verified
zh_hans: 未验证

source: Not a Directory
zh_hans: 不是目录

source: Not in PATH
zh_hans: 不在 PATH 中

source: Not managed by macOS
zh_hans: 不由 macOS 管理

source: Not measured
zh_hans: 尚未测量

source: Not used for 90 days
zh_hans: 90 天以上未使用

source: Note
zh_hans: 提示

source: Nothing else depends on this
zh_hans: 没有其他软件包依赖它

source: Nothing in this list was found in your PATH.
zh_hans: 在你的 PATH 中没有找到此列表中的工具。

source: Nothing to clean up
zh_hans: 没有需要清理的内容

source: Notify
zh_hans: 仅提醒

source: Notify me about updates and results
zh_hans: 通知我可用更新和执行结果

source: OK
zh_hans: 好

source: Off
zh_hans: 关闭

source: Official installer
zh_hans: 官方安装程序

source: Old %@ versions and cache
zh_hans: %@ 旧版本和缓存

source: On request
zh_hans: 手动安装

source: Once a day
zh_hans: 每天一次

source: Only the items previewed by the dry run below are removed.
zh_hans: 只会移除下方试运行预览中列出的项目。

source: Only when connected to power
zh_hans: 仅在接通电源时

source: Open CLI State to review and update.
zh_hans: 打开 CLI State 查看并更新。

source: Open CLI State to review updates that couldn't run automatically.
zh_hans: 打开 CLI State，检查无法自动执行的更新。

source: Opens the Settings window
zh_hans: 打开设置窗口

source: Operation
zh_hans: 操作

source: Operations that CLI State runs appear here.
zh_hans: CLI State 执行的操作会记录在这里。

source: Original target
zh_hans: 原目标

source: Other
zh_hans: 其他

source: Other copy has updates
zh_hans: 其他安装可更新

source: Other packages depend on this
zh_hans: 有其他软件包依赖它

source: Over 90 days
zh_hans: 超过 90 天

source: Overview
zh_hans: 概览

source: Overview charts
zh_hans: 概览统计

source: Ownership is confirmed
zh_hans: 归属已确认

source: Ownership isn't confirmed
zh_hans: 归属未确认

source: PATH configuration, missing apps and installation conflicts require individual review. This action does not uninstall tools or restart services.
zh_hans: PATH 配置、程序缺失和安装冲突需逐项检查。本操作不卸载工具，也不重启服务。

source: PATH entries are searched in order; the first match runs.
zh_hans: 按顺序查找 PATH 条目，执行第一个匹配项。

source: PATH entry doesn't exist
zh_hans: PATH 条目不存在

source: PATH priority %lld
zh_hans: PATH 优先级 %lld

source: PHP Development
zh_hans: PHP 开发

source: Package
zh_hans: 软件包

source: Package Manager
zh_hans: 包管理器

source: Package Managers
zh_hans: 包管理器

source: Package info couldn't be refreshed because %@ returned an error. View the output for details.
zh_hans: 未能刷新软件包信息，%@ 返回了错误。请查看输出了解详情。

source: Package info refreshed
zh_hans: 软件包信息已刷新

source: Package info updated %@
zh_hans: 软件包信息更新于 %@

source: Package information could not be refreshed. Check provider availability and try again.
zh_hans: 无法刷新软件包信息，请检查安装来源是否可用后重试。

source: Package information could not be refreshed. Check your connection and try again before updating.
zh_hans: 软件包信息刷新失败，请检查网络后重试，再进行更新。

source: Package name is valid
zh_hans: 软件包名称有效

source: Package name isn't valid
zh_hans: 软件包名称无效

source: Packages installed as dependencies that nothing needs anymore.
zh_hans: 作为依赖安装、但已不再被任何软件包需要的软件包。

source: Packages installed only because another package needs them.
zh_hans: 仅因其他软件包需要而安装的软件包。

source: Passed
zh_hans: 通过

source: Patch
zh_hans: 补丁

source: Patch and minor updates only
zh_hans: 仅补丁和次版本更新

source: Pre-release
zh_hans: 预发布版

source: Prefer a native build for this Mac. Keep the Intel installation if an existing project depends on it.
zh_hans: 建议：优先使用适合这台 Mac 的原生版本；如现有项目依赖 Intel 版本，可以保留。

source: Preparing actions…
zh_hans: 正在准备…

source: Previewed with dry runs. Nothing changes until you confirm, and CLI State uses only package manager commands or the Trash.
zh_hans: 以下内容通过试运行预览。确认之前不会有任何更改，并且只使用包管理器自带的命令或废纸篓。

source: Previewing cleanup…
zh_hans: 正在预览可清理的内容…

source: Previous versions kept after upgrades, plus cached downloads.
zh_hans: 升级后保留的旧版本，以及下载缓存。

source: Priority
zh_hans: 优先级

source: Probable
zh_hans: 可能

source: Program
zh_hans: 程序

source: Protected Location
zh_hans: 受保护位置

source: Provider coverage
zh_hans: 安装来源检测覆盖情况

source: Providers
zh_hans: 安装方式

source: Purpose
zh_hans: 用途分类

source: Python Tools
zh_hans: Python 工具

source: Quickly search text across your project files.
zh_hans: 快速搜索项目文件中的文本。

source: Read, filter and transform JSON data.
zh_hans: 读取、筛选和转换 JSON 数据。

source: Ready to clean
zh_hans: 可清理

source: Recently used
zh_hans: 最近使用

source: Recorded version changes, including external changes and downgrades. Dates are scan detection dates; days before recording began are not counted.
zh_hans: 统计已记录的版本变更，包含外部操作和降级。日期为扫描发现日期，开始记录之前的日期不计入。

source: Recheck
zh_hans: 重新检查

source: Recheck issues
zh_hans: 重新检测问题

source: Refresh
zh_hans: 刷新

source: Refresh %@ metadata
zh_hans: 刷新 %@ 元数据

source: Refresh Package Info
zh_hans: 刷新软件包信息

source: Refresh package info before checking for updates
zh_hans: 检查更新前先刷新软件包信息

source: Refresh preview
zh_hans: 刷新预览

source: Refresh the preview or change the filter to see available items.
zh_hans: 刷新预览或调整筛选，查看可用项目。

source: Refreshing package information and checking updates…
zh_hans: 正在刷新软件包信息并检查更新…

source: Refreshing package information…
zh_hans: 正在刷新软件包信息…

source: Relative
zh_hans: 相对路径

source: Relative PATH entry
zh_hans: 相对路径的 PATH 条目

source: Remove
zh_hans: 移除

source: Remove unused %@ dependencies
zh_hans: 移除 %@ 中不再需要的依赖

source: Remove unused runtime
zh_hans: 移除闲置的运行时

source: Removed the %@ installation of %@
zh_hans: 已卸载 %2$@ 的 %1$@ 安装副本

source: Removed the %@ installation; %lld other installations remain
zh_hans: 已卸载 %1$@ 副本，另有 %2$lld 份安装仍保留

source: Removes this installation. Review the confirmation before continuing.
zh_hans: 移除此来源的安装，继续前可查看并确认操作。

source: Replace this entry with an absolute directory path in your shell configuration.
zh_hans: 建议：在终端配置中，将此项改成完整的绝对目录路径。

source: Report an Issue
zh_hans: 提交问题

source: Reported version matches %@
zh_hans: 报告的版本与 %@ 一致

source: Requires a network connection
zh_hans: 需要网络连接

source: Rescan the environment (⌘R)
zh_hans: 重新扫描环境（⌘R）

source: Reserved word
zh_hans: 保留字

source: Resolves to
zh_hans: 解析为

source: Restart
zh_hans: 重启

source: Restart %@
zh_hans: 重启 %@

source: Restart Now
zh_hans: 立即重启

source: Restart Service
zh_hans: 重启服务

source: Result
zh_hans: 结果

source: Retry scan
zh_hans: 重试检测

source: Retry the scan. If it still fails, check the reported error and the package manager in Terminal.
zh_hans: 建议：重试检测；若仍失败，在终端检查包管理器，并根据错误信息排查。

source: Reveal %@ in Finder
zh_hans: 在访达中显示 %@

source: Reveal in Finder
zh_hans: 在访达中显示

source: Reveal link in Finder
zh_hans: 在访达中定位链接

source: Review First
zh_hans: 请先检查

source: Review PATH issues
zh_hans: 查看 PATH 问题

source: Review dependencies and your needs before uninstalling. Low activity alone is not a reason to remove a tool.
zh_hans: 卸载前请查看依赖关系，并确认自己不再需要。近期活动少不代表可以直接删除。

source: Review in Cleanup
zh_hans: 在清理中查看

source: Review installation
zh_hans: 查看安装详情

source: Review installation (%lld)
zh_hans: 查看安装清单（%lld）

source: Review manual handling…
zh_hans: 查看需手动处理项…

source: Review missing and duplicate entries before editing shell configuration.
zh_hans: 修改终端配置前，请先核对不存在和重复的目录。

source: Review project compatibility before upgrading to a supported runtime. An available update may not resolve end-of-life status.
zh_hans: 建议：先检查项目兼容性，再升级到仍受支持的运行环境。普通更新不一定能解决停止维护的问题。

source: Review remaining issues
zh_hans: 查看剩余问题

source: Review selected actions
zh_hans: 预览处理方案

source: Review the alias or function in your shell configuration. Keep it if intentional, or remove it there to run the executable from PATH.
zh_hans: 建议：检查终端配置里的同名别名或函数；有意设置的可以保留，否则移除后才会运行 PATH 中的程序。

source: Review what can be removed before making changes.
zh_hans: 先查看清理内容，再决定处理哪些项目。

source: Run %lld operations
zh_hans: 执行 %lld 个操作

source: Run PHP scripts and build web applications.
zh_hans: 运行 PHP 脚本，开发 Web 应用。

source: Running
zh_hans: 运行中

source: Running services
zh_hans: 运行中的服务

source: Running…
zh_hans: 正在执行…

source: Runs brew update before every check, so newly released versions show up right away. It only updates package information, never installed tools.
zh_hans: 每次检查前先运行 brew update，刚发布的新版本能马上显示出来。它只更新软件包信息，不会改动已安装的工具。

source: Runtime
zh_hans: 运行时

source: Runtimes
zh_hans: 运行时

source: Save report…
zh_hans: 保存报告…

source: Scan failed
zh_hans: 扫描失败

source: Scanned %@
zh_hans: %@扫描

source: Scanning
zh_hans: 扫描

source: Scanning your environment…
zh_hans: 正在扫描你的环境…

source: Scanning…
zh_hans: 正在扫描…

source: Scheduled
zh_hans: 已计划

source: Scope: supported CLI tools, providers, PATH, links, conflicts and services. This is not a full-disk or security scan. Update information may use cached package indexes.
zh_hans: 检测范围：已支持的命令行工具、安装来源、PATH、链接、冲突及服务。不是全盘或安全扫描；更新信息可能使用缓存的软件包索引。

source: Script
zh_hans: 脚本

source: Search cleanup items or paths
zh_hans: 搜索清理项目或路径

source: Search recommendations
zh_hans: 搜索推荐工具

source: Search tools
zh_hans: 搜索工具

source: Select %@
zh_hans: 选择 %@

source: Select a tool to see how it's installed and which binary Terminal runs.
zh_hans: 选择一个工具，查看它的安装方式以及终端实际运行的是哪个文件。

source: Select available tools
zh_hans: 选择当前未安装项

source: Select tool
zh_hans: 选择工具

source: Service %@ failed
zh_hans: 服务 %@ 运行失败

source: Services
zh_hans: 服务

source: Settings
zh_hans: 设置

source: Settings (⌘,)
zh_hans: 设置（⌘,）

source: Several installations provide %@. Terminal runs the first one in PATH; the others are shadowed.
zh_hans: 有多个安装提供 %@。终端运行 PATH 中的第一个，其余的被遮蔽。

source: Shadowed
zh_hans: 被遮蔽

source: Shell builtin
zh_hans: Shell 内建命令

source: Show Activity
zh_hans: 显示活动

source: Show All
zh_hans: 查看全部

source: Show Details
zh_hans: 显示详情

source: Show PATH
zh_hans: 查看 PATH

source: Show Tool
zh_hans: 查看工具

source: Show all %lld tools
zh_hans: 查看全部 %lld 个工具

source: Show all issues
zh_hans: 查看全部问题

source: Show dependencies
zh_hans: 显示依赖

source: Show system-managed tools
zh_hans: 显示系统管理的工具

source: Show tools
zh_hans: 查看工具

source: Show unrecognized tools
zh_hans: 显示无法识别的工具

source: Showing the first 8 issues. Open all issues for the complete list.
zh_hans: 显示前 8 个问题，可打开全部问题查看完整列表。

source: Showing the first 8 tools. Open Updates for the complete list.
zh_hans: 显示前 8 个工具，可打开更新页面查看完整列表。

source: Showing the last %lld lines
zh_hans: 仅显示最后 %lld 行

source: Shows the details and actions
zh_hans: 显示说明和操作

source: Sizes are measured when CLI State checks for updates.
zh_hans: 检查更新时会统计每个工具占用的空间。

source: Skip %@ %@
zh_hans: 跳过 %1$@ %2$@

source: Skip This Version
zh_hans: 跳过此版本

source: Skipped versions
zh_hans: 已跳过的版本

source: Some commands are broken or can't be found.
zh_hans: 部分命令已损坏或无法找到。

source: Some installations of %@ are built for Intel and run under Rosetta.
zh_hans: %@ 的部分安装是为 Intel 构建的，需要通过 Rosetta 运行。

source: Source
zh_hans: 来源

source: Sources checked successfully
zh_hans: 成功检测的来源

source: Stable release
zh_hans: 正式版

source: Stale data
zh_hans: 保留的旧数据

source: Standalone
zh_hans: 独立安装

source: Standalone: installations not attributed to a supported package manager.
zh_hans: 独立安装：未归属于受支持包管理器的安装。

source: Start
zh_hans: 启动

source: Start %@
zh_hans: 启动 %@

source: Started by
zh_hans: 发起者

source: State
zh_hans: 状态

source: Status
zh_hans: 状态

source: Still %@
zh_hans: 仍为 %@

source: Stop
zh_hans: 停止

source: Stop %@
zh_hans: 停止 %@

source: Stop Skipping
zh_hans: 取消跳过

source: Stop skipping %@ %@
zh_hans: 不再跳过 %1$@ %2$@

source: Stopped
zh_hans: 已停止

source: Storage, categories and services
zh_hans: 空间、分类与服务

source: Succeeded
zh_hans: 成功

source: Suggestion only
zh_hans: 仅建议

source: Suggestions
zh_hans: 建议

source: Supported CLI environment only. Missing data is not a successful check; stopped services are not necessarily problems.
zh_hans: 仅检查已支持的命令行环境。缺少数据不代表正常；服务停止也不一定是问题。

source: Supports updates
zh_hans: 支持更新

source: System
zh_hans: 跟随系统

source: System Managed
zh_hans: 系统管理

source: Terminal runs the %@ installation (%@). The %@ installation (%@) comes later in PATH, so it's shadowed, and updating it won't change what runs.
zh_hans: 终端运行的是来自「%1$@」的版本（%2$@）。来自「%3$@」的版本（%4$@）在 PATH 中排在后面，因此被遮蔽，更新它不会影响这个命令。

source: Terminal runs the first match for %@:
zh_hans: 终端运行 %@ 的第一个匹配项：

source: The current preview has no cleanup items. Environment issues may still need separate handling.
zh_hans: 当前预览中没有清理项目，环境问题仍需单独检查和处理。

source: The environment scan didn't finish. Try again.
zh_hans: 环境扫描没有完成，请重试。

source: The file Terminal finds for %@ points to something that no longer exists.
zh_hans: 终端为 %@ 找到的文件指向了已不存在的目标。

source: The last scan of %@ failed. CLI State shows the most recent data that was available.
zh_hans: 上次扫描 %@ 失败，CLI State 显示的是最近一次可用的数据。

source: The login shell could not be read. PATH uses fallback data; review shell configuration before making changes.
zh_hans: 无法读取登录 Shell，PATH 使用备用数据；修改前请先检查 Shell 配置。

source: The new language applies after CLI State restarts.
zh_hans: 新语言将在 CLI State 重启后生效。

source: The service action for %@ failed because %@ returned an error. View the output for details.
zh_hans: %1$@ 的服务操作失败，%2$@ 返回了错误。请查看输出了解详情。

source: The service exited with an error. Check its log, then restart it.
zh_hans: 服务异常退出。请查看日志后重启。

source: The target exists now. Run the check again; no removal is needed.
zh_hans: 目标现在已存在，请重新检测，无需移除。

source: These links no longer need cleanup. Review the latest results.
zh_hans: 这些链接已不需要清理，请查看最新检测结果。

source: These tools are already installed.
zh_hans: 这些工具已经安装。

source: This entry is relative, so what it finds depends on the current directory.
zh_hans: 该条目是相对路径，查找结果取决于当前目录。

source: This is a system location. Do not delete it manually; use macOS updates or the component's installer to repair it.
zh_hans: 这是系统位置，请勿手动删除；应通过 macOS 更新或对应组件的安装程序修复。

source: This item is no longer in the latest scan. Refresh, then try again.
zh_hans: 最新扫描中已找不到该项目。请刷新后重试。

source: This macOS installation is maintained through system updates and cannot be uninstalled here.
zh_hans: 此 macOS 安装通过系统更新维护，不支持在这里单独卸载。

source: This path is no longer a symbolic link. Run the check again before taking action.
zh_hans: 此路径已不再是符号链接，请先重新检测再处理。

source: Time range
zh_hans: 时间范围

source: Tool ID
zh_hans: 工具 ID

source: Tools
zh_hans: 工具

source: Tools that ship with macOS, such as git and python3 in /usr/bin.
zh_hans: macOS 自带的工具，例如 /usr/bin 中的 git 和 python3。

source: Tools with updates
zh_hans: 有更新的工具

source: Track code changes and collaborate on projects.
zh_hans: 记录代码变更，与他人协作开发项目。

source: Troubleshooting
zh_hans: 故障排查

source: Try Again
zh_hans: 重试

source: Type a command to see every match in PATH order.
zh_hans: 输入命令，按 PATH 顺序查看所有匹配项。

source: Unavailable
zh_hans: 不可用

source: Unclassified
zh_hans: 未分类

source: Understand and manage your Mac's command-line environment.
zh_hans: 了解并管理 Mac 的命令行环境。

source: Uninstall
zh_hans: 卸载

source: Uninstall %@
zh_hans: 卸载 %@

source: Uninstall command
zh_hans: 卸载命令

source: Uninstall…
zh_hans: 卸载…

source: Universal
zh_hans: 通用

source: Unknown
zh_hans: 未知

source: Unreadable
zh_hans: 无法读取

source: Unrecognized
zh_hans: 无法识别

source: Unused %@ dependencies
zh_hans: %@ 中不再需要的依赖

source: Unused runtime
zh_hans: 闲置的运行时

source: Unused runtime: %@
zh_hans: 闲置的运行时：%@

source: Update
zh_hans: 更新

source: Update %@
zh_hans: 更新 %@

source: Update %@ copy
zh_hans: 更新 %@ 版本

source: Update %lld Tools
zh_hans: 更新 %lld 个工具

source: Update %lld tools
zh_hans: 更新 %lld 个工具

source: Update All
zh_hans: 全部更新

source: Update Available
zh_hans: 可更新

source: Update server
zh_hans: 官方服务器

source: Updated %lld tools
zh_hans: 已更新 %lld 个工具

source: Updated %lld tools automatically
zh_hans: 已自动更新 %lld 个工具

source: Updated to %@
zh_hans: 已更新到 %@

source: Updates
zh_hans: 更新

source: Updates don't affect environment status. Automatic updates skip major versions unless you allow them.
zh_hans: 更新不会影响环境状态。除非你允许，自动更新会跳过大版本。

source: Updates follow your tool visibility settings. Cleanup rechecks broken links before preparing the actions. You can review every command and path before confirming.
zh_hans: 更新范围遵循工具显示设置；清理前会重新核对失效链接。确认前可查看每条命令和路径。

source: Usage recency
zh_hans: 近期使用分布

source: Use Default (%@)
zh_hans: 使用默认设置（%@）

source: Use Default Setting
zh_hans: 使用默认设置

source: Used by
zh_hans: 被依赖于

source: User
zh_hans: 用户

source: Uses the default setting.
zh_hans: 当前沿用默认设置。

source: Version
zh_hans: 版本

source: Version %@
zh_hans: 版本 %@

source: Version Manager
zh_hans: 版本管理器

source: Version Unchanged
zh_hans: 版本未变化

source: Version change trend
zh_hans: 版本变更趋势

source: Version source
zh_hans: 版本来源

source: View Output
zh_hans: 查看输出

source: View installed
zh_hans: 查看已安装

source: Waiting for output…
zh_hans: 等待输出…

source: Warning
zh_hans: 警告

source: Warnings
zh_hans: 警告

source: Website
zh_hans: 网站

source: What can I manage?
zh_hans: 我可以管理哪些工具？

source: Will free space from
zh_hans: 将释放空间

source: Will install
zh_hans: 将安装

source: Will remove
zh_hans: 将移除

source: Will upgrade dependencies
zh_hans: 将升级依赖

source: Will upgrade dependents
zh_hans: 将升级依赖它的软件包

source: Within 7 days
zh_hans: 7 天内

source: Writable
zh_hans: 可写

source: Writable: your account can add programs to this folder, and Terminal will find them.
zh_hans: 可写：你的账户可以向这个目录添加程序，终端会找到它们。

source: You
zh_hans: 你

source: You can free up to %@
zh_hans: 最多可回收 %@

source: Your command-line environment looks consistent.
zh_hans: 你的命令行环境看起来一切正常。

source: Your shell runs an alias or function named %@ before looking in PATH, so the tool shown here may not be what runs.
zh_hans: Shell 会在查找 PATH 之前运行名为 %@ 的别名或函数，因此实际运行的可能不是这里显示的工具。

source: just now
zh_hans: 刚刚

source: macOS copies are maintained through system updates. A Homebrew copy of the same tool is a separate installation with its own update and uninstall actions.
zh_hans: macOS 自带版本通过系统更新维护。同名工具的 Homebrew 版本是另一份安装，更新和卸载能力分别判断。

source: macOS: system-managed copies, maintained with the operating system.
zh_hans: macOS：由系统管理的工具副本，随操作系统维护。

source: npm: JavaScript package manager. Counts globally installed command-line tools.
zh_hans: npm：JavaScript 包管理器。这里统计全局安装的命令行工具。

# tool.summary.aider
source: AI pair programming in the terminal.
zh_hans: 在终端里进行 AI 结对编程。

# tool.summary.bun
source: Fast JavaScript runtime, bundler and package manager.
zh_hans: 高速 JavaScript 运行时，集打包器与包管理器于一体。

# tool.summary.caddy
source: Web server with automatic HTTPS.
zh_hans: 自动配置 HTTPS 的 Web 服务器。

# tool.summary.cargo
source: Rust package manager and build tool.
zh_hans: Rust 包管理器与构建工具。

# tool.summary.claude-code
source: Anthropic's agentic coding tool for the terminal.
zh_hans: Anthropic 推出的终端 AI 编程助手。

# tool.summary.codex
source: OpenAI's coding agent for the terminal.
zh_hans: OpenAI 推出的终端编程智能体。

# tool.summary.composer
source: Dependency manager for PHP.
zh_hans: PHP 依赖管理工具。

# tool.summary.copilot-cli
source: GitHub Copilot's coding agent for the terminal.
zh_hans: GitHub Copilot 的终端编程智能体。

# tool.summary.curl
source: Transfer data with URLs.
zh_hans: 通过 URL 传输数据。

# tool.summary.deno
source: Secure JavaScript and TypeScript runtime.
zh_hans: 安全的 JavaScript 与 TypeScript 运行时。

# tool.summary.ffmpeg
source: Record, convert and stream audio and video.
zh_hans: 录制、转换和推流音视频。

# tool.summary.fzf
source: Command-line fuzzy finder.
zh_hans: 命令行模糊查找工具。

# tool.summary.gem
source: Package manager for Ruby.
zh_hans: Ruby 包管理器。

# tool.summary.gemini-cli
source: Google's Gemini agent for the terminal.
zh_hans: Google 推出的终端 Gemini 智能体。

# tool.summary.gh
source: GitHub on the command line.
zh_hans: 在命令行中使用 GitHub。

# tool.summary.git
source: Distributed version control system.
zh_hans: 分布式版本控制系统。

# tool.summary.go
source: Statically typed, compiled language from Google.
zh_hans: Google 推出的静态类型编译型语言。

# tool.summary.homebrew
source: The missing package manager for macOS.
zh_hans: macOS 缺失的软件包管理器。

# tool.summary.imagemagick
source: Create, edit and convert bitmap images.
zh_hans: 创建、编辑和转换位图图像。

# tool.summary.java
source: Java runtime and development kit.
zh_hans: Java 运行时与开发工具包。

# tool.summary.jq
source: Command-line JSON processor.
zh_hans: 命令行 JSON 处理工具。

# tool.summary.kimi-cli
source: Moonshot AI's Kimi coding agent for the terminal.
zh_hans: 月之暗面推出的终端 Kimi 编程智能体。

# tool.summary.mongodb
source: Document-oriented database server.
zh_hans: 面向文档的数据库服务器。

# tool.summary.mysql
source: Relational database server.
zh_hans: 关系型数据库服务器。

# tool.summary.nginx
source: HTTP server and reverse proxy.
zh_hans: HTTP 服务器与反向代理。

# tool.summary.node
source: JavaScript runtime built on V8.
zh_hans: 基于 V8 引擎的 JavaScript 运行时。

# tool.summary.npm
source: Package manager bundled with Node.js.
zh_hans: 随 Node.js 附带的包管理器。

# tool.summary.opencode
source: Open-source AI coding agent for the terminal.
zh_hans: 开源的终端 AI 编程智能体。

# tool.summary.php
source: General-purpose scripting language for web development.
zh_hans: 通用脚本语言，常用于 Web 开发。

# tool.summary.pip
source: Package installer for Python.
zh_hans: Python 包安装工具。

# tool.summary.pipx
source: Install and run Python applications in isolated environments.
zh_hans: 在隔离环境中安装和运行 Python 应用。

# tool.summary.pnpm
source: Fast, disk-efficient Node.js package manager.
zh_hans: 快速、节省磁盘空间的 Node.js 包管理器。

# tool.summary.postgresql
source: Object-relational database system.
zh_hans: 对象关系型数据库系统。

# tool.summary.python
source: Interpreted programming language.
zh_hans: 解释型编程语言。

# tool.summary.qwen-code
source: Alibaba's Qwen coding agent for the terminal.
zh_hans: 阿里巴巴推出的终端 Qwen 编程智能体。

# tool.summary.redis
source: In-memory data store.
zh_hans: 内存数据存储。

# tool.summary.ripgrep
source: Recursively search directories for a regex pattern.
zh_hans: 按正则表达式递归搜索目录。

# tool.summary.ruby
source: Dynamic, object-oriented scripting language.
zh_hans: 动态的面向对象脚本语言。

# tool.summary.rust
source: Systems programming language focused on safety and speed.
zh_hans: 注重安全与性能的系统编程语言。

# tool.summary.rustup
source: Rust toolchain installer.
zh_hans: Rust 工具链安装器。

# tool.summary.sqlite
source: Self-contained SQL database engine.
zh_hans: 自包含的 SQL 数据库引擎。

# tool.summary.tmux
source: Terminal multiplexer.
zh_hans: 终端复用器。

# tool.summary.uv
source: Extremely fast Python package and project manager.
zh_hans: 极快的 Python 包与项目管理工具。

# tool.summary.wget
source: Retrieve files over HTTP, HTTPS and FTP.
zh_hans: 通过 HTTP、HTTPS 和 FTP 下载文件。

# tool.summary.yarn
source: Node.js package manager.
zh_hans: Node.js 包管理器。

# updateSource.automatic
source: Automatic
zh_hans: 自动

source: uv: Python package and project manager. Counts command-line tools installed through uv, not the number of uv copies.
zh_hans: uv：Python 包和项目管理工具。这里统计通过 uv 安装的命令行工具，不是 uv 自身的副本数量。

source: It points to %@, which no longer exists. This can happen after its app is removed. Check the resolution below before changing the link.
zh_hans: 它指向的 %@ 已不存在，可能是所属应用被移除后留下的。更改链接前，请先查看下方处理方案。

source: Ready to handle
zh_hans: 可直接处理

source: CLI State confirmed this broken link can be moved to the Trash. It will check the link again and ask for confirmation first.
zh_hans: CLI State 已确认可以把这个失效链接移到废纸篓。操作前会重新检查链接并请你确认。

source: If you still need the original app, reinstall it instead of removing the link.
zh_hans: 如果仍需使用原应用，请重新安装应用，而不是移除链接。

source: System managed
zh_hans: 系统管理

source: This link is in a macOS-managed location. CLI State cannot remove it, and manual deletion is not recommended.
zh_hans: 此链接位于 macOS 管理的位置，CLI State 无法移除，也不建议手动删除。

source: Leave the link in place; a macOS update or the component installer can repair it.
zh_hans: 保留此链接；macOS 更新或该组件的安装程序可能修复它。

source: Administrator required
zh_hans: 需要管理员授权
